Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/third_level_education/fees_and_supports_for_third_level_education/maintenance_grant_schemes_for_students_on_third_level_courses.html.txt.tmx
Source language: en
Languages: ga

source: From 3 April 2017, you can apply for a student grant for the 2017/2018 academic year
ga: Ón 3 Aibreán 2017 amach, is féidir iarratas a dhéanamh ar dheontas mac léinn i leith na bliana acadúla 2017/2018

source: Since 2012, Student Universal Support Ireland (SUSI) is the single grant-awarding authority handling all new applications for student grants
ga: Ó 2012 i leith, is í Tacaíocht Chomhchoiteann do Mhic Léinn in Éirinn (SUSI) an t-údarás aonair bronnta deontais a láimhseálann gach iarratas nua ar dheontais mhac léinn

source: All new grant applications will be made online
ga: Déanfar an uile iarratas nua ar dheontas ar líne

source: You do not need to know the exact course you will be attending in order to apply online
ga: Ní gá a fhios a bheith agat cé'n cúrsa a mbeidh tú ag freastal air, sula ndéanann tú d'iarratas ar dheontas

source: You can get information about applying online for a student grant for the 2017-2018 academic year
ga: Is féidir leat iarratas a dhéanamh ar líne do dheontas i leith na bliana 2016-2017

source: You will need your Personal Public Service Number (PPSN) and an email address and phone number to apply online
ga: Is gá duit d’Uimhir Phearsanta Seirbhíse Poiblí, uimhir bailí teileafóin agus seoladh ríomhphoist chun iarratas ar líne a dhéanamh

source: The closing date for receipt of student grant applications for the 2017-2018 academic year is 13 July 2017
ga: Sé an dáta deiridh i gcomhair iarratais ar dheontas mic léinn le haghaidh na bliana acadúil 2017-2018 ná an 13 Iúil 2016

source: SUSI's helpdesk is handling email and telephone queries - see 'Where to apply' below
ga: Tá deasc cabhrach SUSI ag déileáil le ceisteanna cheana féin, trí ríomhphost agus ar an dteileafón - féach 'Cá háit a dhéanfaidh mé iarratas' thíos

source: Renewals of existing grants will be handled by the authority that issued them initially
ga: I gcás athnuachan deontais reatha, leanfaidh an t-údarás a d'eisigh an deontas cheana ar aghaidh ag déileáil leo

source: Student grants are reviewed each year
ga: Déantar athbhreithniú ar dheontas do mhic léinn gach bliain

source: If you had a grant in one academic year and are continuing your studies on the course in the following year, the body that awarded the grant will be in contact with you in order to renew or re-assess your student grant for that next year
ga: Más rud é go raibh deontas agat in bliain acadúil amháin agus má tá tú ag leanúint ar aghaidh le do chuid staidéir ar an gcúrsa sa bhliain ina dhiadh sin, déanfaidh an comhlacht a d' íoc do dheontas teagmháil leat chun athnuachan nó athmheasúnú a dhéanamh ar do dheontas do mhic léinn don bhliain eile

source: If you are considered eligible on initial assessment of your application, you will get a provisional grant approval in the post and a personalised list of the supporting documents that you need to provide
ga: Má mheastar gur incháilithe thú tar éis measúnú tosaigh a dhéanamh ar d’iarratas, gheobhaidh tú ceadú sealadach deontais sa phost mar aon le liosta pearsantaithe de na doiciméid tacaíochta is gá duit a sholáthar

source: You should send the necessary documents (photocopies, not originals) as soon as possible in the envelope supplied
ga: Ba cheart duit na doiciméid riachtanacha (fotachóipeanna seachas bunchóipeanna) a sheoladh ar aghaidh a luaithe agus is féidir sa chlúdach litreach a chuirtear ar fáil

source: SUSI will then process your application to award stage, subject to confirmation of your acceptance on an approved course
ga: Déanfaidh SUSI d’iarratas a phróiseáil ansin chuig céim an cháiliúcháin, faoi réir deimhniú go nglacfaidh tú le háit ar chúrsa ceadaithe

source: If you think that you have been unjustly refused a grant, you may appeal by writing to the organisation you applied to
ga: Más dóigh leat gur diúltaíodh deontas duit go héagórach, is féidir leat achomharc a dhéanamh i scríbhinn chuig an eagraíocht ar chuir tú isteach orthu

source: You must appeal within 30 days of getting your decision
ga: Ní mór duit achomharc a dhéanamh laistigh de 30 lá tar éis do chinneadh a fháil

source: If your appeal is turned down, and you feel that the conditions have not been interpreted correctly, you can make a further appeal
ga: Má dhiúltaítear d’achomharc, agus má bhraitheann tú nár baineadh an chiall ba cheart as na coinníollacha, is féidir leat achomharc breise a dhéanamh

source: If you are not satisfied with the decision from an appeals officer in a grant-awarding authority you can make a further appeal to the Student Grants Appeals Board
ga: Má bheidh tú ag tosú nó ag bogadh go dtí cúrsa nua ó 2011 ar aghaidh, ba cheart duit an t-achomharc breise seo a sheoladh, laistigh de 30 lá tar éis do chinneadh a fháil, go dtí an Bord Achomhairc um Dheontais Mhic Léinn, a bunaíodh faoin Acht um Thacaíocht do Mhic Léinn, 2011

source: You should submit your appeal online to the Student Grants Appeals Board
ga: Comhlánaigh an fhoirm ‘Fógra Achomhairc leis an mBord Achomharc um Dheontais do Mhic Léinn’, atá ar fáil ó d’údarás cáiliúcháin deontais

source: Your appeal must be submitted within 30 days from the date of the letter from the appeals officer in SUSI or the awarding authority
ga: Má tá tú ag leanúint le cúrsa a thosaigh tú roimh 2011, ba cheart duit an t-achomharc breise seo a sheoladh chuig an rannóg do Chothromas Rochtana ar an Ardoideachas den Roinn Oideachais agus Scileanna trí leas a bhaint as an bhfoirm ‘Fógra Achomhairc leis an Aire’, atá ar fáil ó údarás cáiliúcháin an deontais

source: You can only appeal the outcome of a decision from an appeals officer in a grant-awarding authority to the Student Grants Appeals Board
ga: Níor cheart duit scríobh chuig an mBord Achomharc nó chuig an Roinn Oideachais agus Scileanna más mian leat toradh achomhairc thosaigh a achomharc le húdarás cáiliúcháin an deontais

source: Student Universal Support Ireland (SUSI)
ga: Tacaíocht Uilíoch do Mhic Léinn, Éire (SUSI)

source: Tel: 0761 08 7874
ga: Teil: 0761 08 7874

source: Approved courses and institutions
ga: Cúrsaí agus institiúidí ceadaithe

source: In general, the Student Grant Scheme covers all the approved courses and institutions covered by the 4 schemes it replaced. Details of what each scheme covered are below
ga: Go ginearálta, clúdaíonn an Scéim Deontais nua do Mhic Léinn gach cúrsa formheasta agus institiúidí clúdaithe ag na 4 scéim a d’athchuir sé

source: The approved courses are prescribed in the Student Support Regulations 2017 (pdf)
ga: Tá sonraí maidir leis an méid a chlúdaigh gach scéim ar fáil thíos

source: The approved institutions are listed in Schedules 1 and 2 of the Regulations
ga: Tá na cúrsaí formheasta leagtha síos i Rialachán 4 de na Rialacháin Tacaíochta do Mhic Léinn 2016 agus tá na hinstitiúidí formheasta liostáilte i Sceidil 1 agus 2 de na Rialacháin
